Repository: webbisivut-zz/woocommerce-distance-based-fee
Catalog: lang/woocommerce-distance-based-fee-*.po
Languages: fi

source: Distance based fee settings
fi: Etäisyyteen perustuvan kulun asetukset

source: Standard
fi: Yleiset

source: Standard settings
fi: Yleiset asetukset

source: Google API key
fi: Google API avain

source: Enter your Google API key in this field. You can get your API key <a target="_blank" href="https://developers.google.com/maps/documentation/javascript/get-api-key">from here.</a>
fi: Anna Google API avain tähän kenttään. API avaimen saat haettua<a target=”_blank” href=”https://developers.google.com/maps/documentation/javascript/get-api-key”>täältä.</a>

source: Fee name
fi: Kulun nimi

source: Enter name for the fee that customer will see on checkout.
fi: Anna kulun nimi jonka asiakas näkee kassalla.

source: Divider
fi: Jakaja

source: Enter your divider number here. Price will be calculated by dividing the distance, and then multiplicated by the price.
fi: Anna jakaja. Hinta lasketaan jakamalla etäisyys jakajalla, ja kertomalla saatu luku hinnalla.

source: Price
fi: Hinta

source: Enter your price for the calculated distance.
fi: Anna hinta lasketulle etäisyydelle.

source: Minimun distance
fi: Lyhin etäisyys

source: Enter the distance after the fee will be added. Leave empty to disable this feature.
fi: Anna lyhietäisyys jonka jälkeen kulu lisätään. Jätä tyhjäksi jos haluat poistaa tämän toiminnon.

source: Maximum distance
fi: Pisin etäisyys

source: Enter the maximum distance for the shipping method, that can be used with the fee. Leave empty to disable this feature.
fi: Anna pisin etäisyys johonka asti kulu lisätään. Jätä tyhjäksi jos haluat poistaa tämän toiminnon.

source: Units
fi: Yksiköt

source: Choose your units for the calculated distance.
fi: Valitse yksikkö lasketulle etäisyydelle.

source: Methods
fi: Toimitustavat

source: Choose which shipping methods this fee is added for.
fi: Valitse mille toimitustavoille kulu on käytössä.

source: Shipping conditions
fi: Toimitusehdot

source: If above conditions are not met, what will happen to the shipping?
fi: Jos asetetut ehdot eivät täyty, mitä tehdään toimitukselle?

source: Fixed fee
fi: Kiinteä hinta

source: If above conditions are not met, fixed fee can be used. Leave empty to disable this feature.
fi: Jos annetut ehdot eivät täyty, voidaan käyttää kiinteää hintaa. Jätä tyhjäksi jos et halua käyttää tätä toimintoa.

source: Taxable
fi: Verotus

source: Is fee taxable?
fi: Onko kulu verotettava?

source: No
fi: Ei

source: Yes
fi: Kyllä

source: Disable virtual products
fi: Poista käytöstä virtuaalisille tuotteille

source: Disable on virtual products?
fi: Poistetaanko kulu käytöstä virtuaalisille tuotteille?

source: Logs
fi: Logit

source: Plugin log file
fi: Logi tiedosto

source: Google API log
fi: Google API logi

source: If your fee won´t work, you can check if Google API has given any error messages.
fi: Jos kulu ei näy, tarkista onko rajapinta antanut virheilmoituksia.

source: Save Settings
fi: Tallenna asetukset

source: Cheatin&#8217; huh?
fi: Huijaatko?

source: Upload an image
fi: Lisää kuva

source: Use image
fi: Käytä kuvaa

source: Upload new image
fi: Lisää uusi kuva

source: Remove image
fi: Poista kuva
